app/controllers/items_controller.rb

INSERT INTO "items" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "shoe"], ["price", 55], ["created_at", "2022-02-12 11:57:39.506124"], ["updated_at", "2022-02-12 11:57:39.506124"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "bird"], ["updated_at", "2022-02-16 14:53:37.830939"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)