app/controllers/items_controller.rb

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "updated_at" = ? WHERE "items"."id" = ?  [["updated_at", "2022-02-16 14:26:48.012577"], ["id", 4]]